spec/dummy/app/controllers/admin/orders_controller.rb

    def create
      order = OrderCreationFacade.new.create(name: "Test")
---
INSERT INTO "orders" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2026-06-15 13:12:00.151819"], ["updated_at", "2026-06-15 13:12:00.151819"]]